# Додайте внесені зміни до стейджингу за допомогою команди git add lesson_07/homework_07.py
# Зробіть коміт з змінами, додавши опис виконаних змін за допомогою команди git commit -m "Виконані зміни".
# Відправте свої зміни до вашого форку репозиторію за допомогою команди git push.
# Створіть pull request у власну гілку main на головний репозиторію https://github.com, натиснувши кнопку"New pull request" на відповідному розділі репозиторію.
# Додайте викладача до рев’юверів
# Посилання на PR вставте у форму відповіді для ДЗ в навчальній системі:
# Після перевірки вашого pull request викладач може підтвердити, що все добре:
# Або вказати помилки та запропонувати змінити щось
# Після отримання Approved гілку можна замержити у main

