# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”


mas = ['1,2,3,4', '1,2,3,4,50', 'qwerty1,2,3', '4, -6, 12', '4,1,8,wero']

def suma(massive):
    for some in massive:
        summer = 0
        list_1 = some.split(',')
        for i in list_1:
            try:
                summer += int(i)
            except ValueError:
                print('Неможливо це зробити')
                break

        else:
            print(summer)

suma(mas)
